Repository: eugeneai/bash-essentials-ru-handbok
Catalog: tmx/en-ru-level2.tmx
Source language: en
Languages: ru

source: Component naturally used to wrap subsystems, in our case, models of manufacturing processes, automatic theorem prover, computer simulation and result visualization subsystems.
ru: Компонент естественным образом используется для того чтобы встраивать сторонние подсистемы в общий комплекс, в нашем случае, модели производственных процессов, автоматическое доказательство теорем, подсистемы имитационного моделирования и визуализации результатов.

source: Component programming (CP) and Python programming language will be the basis of integration of the subsystems.
ru: Компонентное программирование (КП) и язык программирования Python - основа интеграции различных подсистем.

source: Computer simulation during third-level control synthesis will be implemented with Positively-Constructed Formulae (PCFs) inference engine.
ru: Имитационное моделирование в ходе синтеза управления для третьего уровня будет осуществляться при помощи механимов логического вывода метода позитивно-образованных формул (ПОФ).

source: Computer simulation, control synthesis are based also on novel application of the authors’ automatic theorem proving methods, previously used in construction of the complexes of models, their identification, and driving the computer simulation.
ru: Имитационное моделирование и синтез управления основывается на новом применении авторских методов автоматического доказательства теорем, ранее используемых в конструировании комплексов моделей, их идентификации и управлением процессои имитационного моделирования.

source: Conclusion
ru: Заключение

source: Conflicts in STS can be analyzed by construction of a finite chain of sequentially made possible actions (mutual impacts) of opponents.
ru: Один из подходов к анализу конфликтов в СТО - построение конечных последовательностй, состоящих из возможных действий (взаимного воздействия) противников.

source: Consider methods and approaches by each item in details.
ru: Рассмотрим методы и подходы по каждому пункту в деталях.

source: Constrained robust feedback model predictive control for uncertain systems with polytopic description, International Journal of Control, 2009, 82(7): 1267-1274.) proposed a time-varying multi-step control rate algorithm in the distributed predictive control method, in which a "multi-step control set" is designed, and the degree of freedom of the controller is increased.
ru: Constrained robust feedback model predictive control for uncertain systems with polytopic description, International Journal of Control, 2009, 82(7): 1267-1274.) предложил изменяющийся во времени многошаговый алгоритм оценки управления в решнии задачи построения распределенного прогнозирующего управления; при этом создается "множество многошагового управления", при этом увеличивается количество степеней свободы управления.

source: Construction of the computer simulation software version for RDDESU exploration.
ru: Разработка версия программы имитационного моделирования для исследования РУДССН.

source: Continuing our discussion on process management, we can kill processes within the top program.
ru: Продолжая нашу дискуссию по управлению процессами, покажем как "убить" процессы в программе top.

source: Control for RDDESU is synthesized either as supervisor, preventing occurrence of events, or as a set of trajectories of system’s evolution constrained with a time interval (set of ordered time moments), where each time moment corresponds to an admissible state of the system.
ru: Управление РУДССН синтезируется либо как супервизор, предотвращающий возникновения некторых событий, или как набор траекторий эволюции системы, ограниченных интервалом времени (множество упорядоченных моментов времени), где в каждом моменте времени система находится в допустимом состоянии.

source: Control of industrial processes is on the top of scientific interest since first automation was introduced to manufacturing goods or supply utilities.
ru: Управление производственными процессами является представителем объекта, имеющего высокий научный интерес с первых попыток автоматизации производства товаров и услуг.

source: Controllability of specification is a crucial property which must be verified to start building a supervisor.
ru: Управляемость согласно спецификациям является важнейшим свойством, которое должна быть врифицировано перед тем, как синтезировать супервизора.

source: Copyright © 2019 Zach Gollwitzer
ru: Copyright © 2019 Зак Голлвитцер

source: Creation of algorithms of criteria assessment.
ru: Создание алгоритмов оценки критериев.

source: Cuninghame-Green, Minimax Algebra and Applications, Editor(s): Peter W. Hawkes, Advances in Imaging and Electron Physics, Elsevier, Volume 90, 1994, Pages 1-121,) to solve the assignment problem.
ru: Cuninghame-Green, Minimax Algebra and Applications, Editor(s): Peter W. Hawkes, Advances in Imaging and Electron Physics, Elsevier, Volume 90, 1994, Pages 1-121,) при решении задачи назначений.

source: Currently, there are almost no publication on RDDESU due to the problem complexity related to the representation of the object (system) state, resource conversion and lock, uncertainties modeling.
ru: В настоящее время практически отсутствуют публикации о РУДССН из-за сложности задачи, связанной с представлением состояния объекта (системы), преобразования и блокировки ресурсов, моделирования неопределенности.

source: DES aspect of RDDESU is represented with “usual” means, like automaton, system of state conversion defined as function, etc.
ru: Аспект РУДССН представлен стандартными способами, такими как автоматы, системой функций следующего состояния, и т.п.

source: DHCP is a server (usually running on a router) that assigns a new device an IP address when it enters a network.
ru: DHCP - это сервер (обычно работающий на маршрутизаторе), который назначает новому устройству IP-адрес, когда оно входит в сеть.

source: Data integration: Metadata inference
ru: Интеграция данных: вывод метаданных

source: Decentralized control is simpler in structure and more convenient in implementation, but it does not deal with the physical coupling between subsystems.
ru: Структура децентрализованного управления проще, а также проще в реализации, но возникает проблема сопряжения подсистем на физическом уровне.

source: Declaring and using variables is rather simple in bash scripting, so I will not spend a lot of time here.
ru: Объявление и использование переменных в сценариях bash достатосно просто, поэтому не будем тратить много времени на них.

source: Description of the set of rules modeling uncertainties.
ru: Создание набора правил моделирования возникновения неопределенностей.

source: Despite this, there are only a few core concepts that one must understand about regular expressions that will then translate in the ability to use any flavor of regular expressions effectively.
ru: Несмотря на это, есть всего несколько основных концепций, которые нужно понимать о регулярных выражениях, что делает использование любых регулярных выражений эффективным.

source: Despite widespread and commonly understood essence of the described resource-based conflicts, GT state of the art is such, that available mathematical tools, used nowadays by GT developers, are not exactly suitable for completely adequate mathematical formalization of such conflicts, because application of these tools demands explicit representation of sets of possible implementations of conflicts in a form of trees, matrices or automata.
ru: Несмотря на широкую распространность и понимание сути ресурсных конфликтов, состояние области ТИ такова, что имеющиеся математические инструменты, используемые в настоящее время исследователями не совсем подходит для полностью адекватной математической формализации таких конфликтов, поскольку применение этих инструментов требует явного представления множеств возможных реализаций конфликтов в виде деревьев, матриц или автоматов.

source: Detailed Example Regular Expression
ru: Подробный пример использования регулярного выражения

source: Developing a technique for criteria values assessment.
ru: Разработанная методики оценки значений критериев.

source: Developing technique for manufacturing process representation with SysML models,
ru: Разработка технологии представления производственнвх процессов при помодщи SysML,

source: Development of technique of conversion of the properties of the synthesized control into values of generalized criteria.
ru: Разработка методики преобразования свойств синтезированных управлений в значения обобщенных критериев.

source: Development of techniques of assessment the quality of synthesized control as constraint verifications.
ru: Разработка методики оценки качества синтезированного уравления в виде проверки ограничений.

source: Development of the technique for modeling internal uncertainties.
ru: Разработка методики моделирования внутренних неопределенностей.

source: Device information structures representing the three-layered complex RDDESU model of manufacturing process.
ru: Инженерия информационных структур, представляющих трехуровневую комплексную модель РУДССН производственного процесса.

source: Devise an algorithm calculation rating of a future variant.
ru: Разработкаь алгоритмов расчета рейтинга варианта будущего.

source: Devising a strategy of parallel representation of the future variants of computer simulation.
ru: Разработка стратегии параллельного представления вариантов будущего в процессе имитационного моделирования.

source: Devising domain heuristics assigning priorities for the simulation variants.
ru: Разработка предметных эвристик для назначения приоритетов вариантам имиттационных моделей.

source: Digitization of the business processes management supply chains, namely information technology support, resulted in preferable discrete representation of the manufacturing process.
ru: Цифровизация бизнес-процессов управления цепями поставок, а именно поддержка информационными технологиями, привело к предпочтительно дискретному представлению процесса производства.

source: Discrete-event systems (DES) is a wide class of behavior representation of a dynamical systems changing state at a discrete time moments thanks to event occurring.
ru: Дискретно-событийные системы (ДСС) представляет собой широкий класс подходов к моделированию поведения систем, меняющих свое состояние в дискретные моменты времени из-за возникающих событий.

source: Discrete-event systems and their derivatives are the mathematical abstraction widely used in representation of the manufacturing processes of all types (continuous, discrete and batch).
ru: Дискретно-событийные системы и их производные являются математической абстракцией, широко используемой в представлении производственных процессов всех типов (непрерывных, дискретных и серийном производстве).

source: Domain name system (DNS), nameservers, registrars
ru: Система доменных имен (DNS), серверы имён, регистраторы

source: Downloading packages to your remote machine with wget
ru: Загрузка пакетов на удаленный компьютер с помощью wget

source: Due to the large scale of networked systems, it is difficult to realize the traditional centralized control.
ru: Из-за крупномасштабности современных промышленных систем, имеющих сложную разветвленную структуру, реализация традиционного централизованного управления затруднено.

source: During the last 40 years, to investigate the poorly structured and poorly formalized controlled systems it is widely used a discrete-event approach, which is similar to situational control, introduced by D.A.
ru: В течение последних 40 лет исследования слабоструктурированных и слабоформализуемых систем широко используют дискретно-событийный подход, аналогичный ситуативному управлению, введенному Д.А.

source: EN
ru: RU

source: Each component have strongly defined interface definition, which is does not change within implementation versions.
ru: Каждый компонент имеет строго определенный интерфейс, который не меняется в новых версиях или вариантах реализации программ.

source: Each line shown above is actually two commands.
ru: Каждая показанная выше строка на самом деле представляет собой две команды.

source: Each piece of the puzzle is labeled by number and illustrates the general flow of information when you make an internet search.
ru: Каждый фрагмент технологии пронумерован и иллюстрирует общий поток информации при выполнении поиска в Интернете.

source: Each tab will have its own socket.
ru: У каждой вкладки свой сокет.

source: Either of these will stop the running process and give us our terminal back.
ru: Любой из них остановит запущенный процесс и вернет нам доступ к терминалу.

source: Environment variables
ru: Переменные среды

source: Every router will have a default DNS server that it uses.
ru: У каждого маршрутизатора есть DNS-сервер по умолчанию, который он использует.

source: Evgeny Cherkashin
ru: Евгений Черкашин

source: Exception is the research conducted at ICS RAS: it should be noted the works of A.A.
ru: Исследования, проводимые в ИПУ РАН, являются исключением. Например, работы А.А.

source: Fiber optic cables (fastest type - many are in the ocean)
ru: Волоконно-оптические кабели (самый быстрый тип, много оптики лежит на дне океана)

source: File names are slightly truncated in the beginning to fit the text column.
ru: Имена файлов в начале усечены, чтобы соответствовать размерам текста.

source: Filter operations for multisets are the similar structures.
ru: Фильтры мультимножеств являются подобными структурами.

source: Filtering the resulting multisets produces various model forecasting or property evaluations.
ru: Фильтрация результатов-мультимножеств представляют собой различные модели прогнозирования или оценки имеющихся ресурсов.

source: Finally, I want to briefly mention why I never talked about the metacharacters | and ().
ru: Наконец, надо вкратце упомянуть, почему мы не говорили о метасимволах | and ()

source: Finally, press the left arrow key or Enter to place the menu item.
ru: В конце нажатием стрелки "влево" фиксируется позиция.

source: Finally, we can use the whois command to find more information about a given domain name or IP address.
ru: Наконец, команда whois двет дополнительную информацию о данном доменном имени или IP-адресе.

source: Finally, we want to match these characters 1 or more times, so we use the {1,} syntax.
ru: Наконец, надо сопоставлять эти символы один или более раз, поэтому используется форма {1,}.

source: Finally, you need to source ~/.profile to activate this new change.
ru: Наконец, активируем изменения из source ~/.profile в текущем сеансе.

source: Find all documents modified by some user in the last 7 days
ru: Найти все документы, измененные некоторым пользователем за последние 7 дней

source: Find all of the .png files on your computer
ru: Найти все файлы .png на компьютере

source: Find any file that has a certain permission set
ru: Найти файлы, имеющие определенный набор разрешений (permission set)

source: First, I made one of the email addresses invalid.
ru: Во-первых, добавлен недействительный адрес электронной почты.

source: First, we need to understand the basics of a scripting file.
ru: Во-первых, нам нужно понять основы разработки сценариев.

source: First, we test a condition, and second, we print the exit code of the previous command (which was test).
ru: Первая команда - проверка условия, а вторая - печать кода выхода предыдущей команды (которая была test).

source: For Mothur, we construct an automatic metadata inference rules analyzing its C++ source and filename conversion algorithms.
ru: Для Mothur создаются правила автоматического вывода метаданных, анализируя его исходный код C++ и алгоритмы преобразования имени файла.

source: For a concrete manufacturing process.
ru: Для конкретного процесса производства

source: For both, the lower the number, the higher the priority.
ru: Для PR и NI работает общее правило: чем меньше число, тем выше приоритет.

source: For complex formatting/text transformations, use awk
ru: Для сложных преобразований формата и текста используйте awk

source: For dealing with uncertainties of the resource allocation and the demand, all achievements focus on the production planning and scheduling stage and the existing distributed predictive control algorithm has not been involved.
ru: Для учета неопределенности в распределении ресурсов и спроса, все исследования сосредоточены на планировании и составлении расписания производства, однако существующие алгоритмы распределенного предиктивного управления не используются.

source: For each of the model notation a visual editors and export/import formats (such as XMI), usage techniques were designed.
ru: Для каждой визуальной модели существуют редакторы и форматы экспорта/импорта данных (например XMI), разработаны методики использования.

source: For example, I can run the sleep command for 20 seconds in the background.
ru: Например, можно запустить команду sleep, которая будет 20 секунд простаивать в фоновом режиме.

source: For example, I could run the following command:
ru: Например, выполним следующую команду:

source: For example, I could use grep in the following manner.
ru: Например, я мог бы использовать grep следующим образом.

source: For example, I have a key called digital-ocean that I use for logging in to my digital ocean droplets.
ru: Например, есть ключ под названием digital-ocean, который используется для входа цифровые "капли океана".

source: For example, a decision support systems (DSS) has been constructed for forest resources rational consumption DSS was implemented.
ru: Например, построены системы поддержки принятия решений (СППР) для рационального использования лесных ресурсов.

source: For example, a depth-first heuristic could set better priority for the scenarios, which the greatest time moment are nearer to the horizon constraint.
ru: Например, эвристика "в глубину" устанавливает больший приоритет для сценариев, где последний момент времени ближе горизонту.

source: For example, alignments generated against reference alignments (e.g. from RDP, SILVA, or greengenes) often have columns where every character is either a '.' or a '-'.
ru: Например, выравнивания, созданные с помощью референтных выравниваний (например, из RDP, SILVA, или greengenes) часто включают столбцы, где каждый символ - это либо '.' или '-'.

source: For example, if I ran the following script:
ru: Выполним следующий сценарий.

source: For example, if I wanted to search the /etc/passwd file (where all the users on our system are stored) for my name, I could do it like so.
ru: Например, попробуем найти имя пользователя в файле /etc/passwd (где хранятся все пользователи в системе).

source: For example, in the Visual Studio Code Editor, I can use the search bar to search through all the files in my project for a specific word or even regular expression, and I will get results listing the files that the expression was found in, what line it was found on, etc.
ru: Например, в Visual Studio Code Editor можно использовать строку поиска для того, чтобы искать в файлах проекта определенное слово или даже соответствие регулярному выражению. В результате редактором перечисляются файлы, в которых было найдено выражение, указывается строка, где оно было найдено и т.д.

source: For example, inheritance in a prototype hierarchy allows programmer to change rule sets, encapsulation allows simplification of access to input data, recognizing patterns in input data on-the-fly.
ru: Например, наследование в иерархии прототипов позволяет программисту изменять наборы правил, а инкапсуляция позволяет упростить доступ ко входным данным, распознавая шаблоны в исходных данных по запросы.

source: For example, instead of writing -F " ", we can just set the FS variable in our awk file.
ru: Например, вместо флага -F " " можно установить соответствующее значение переменной FS в программе awk.

source: For example, maybe you need to clean out a specific folder on your computer every day and place the contents of it in an archived folder with today’s date on it.
ru: Например, возможно, бывает необходимо ежедневно очищать определенную папку на компьютере и помещать ее содержимое в папку-архив с текущей датой.

source: For example, the awk tool would be good at parsing through a csv file, or a file separated by spaces because it reads each line in chunks rather than characters.
ru: Например, awk хорошо разбивает файл csv или файл, разделенный пробелами, поскольку он обрабатывает вхдоной файл построчно, а не посимвольно.

source: For example, the following character class represents every lowercase letter in the alphabet, but only 1 of them since we added a quantifier - [a-z]{1}.
ru: Например, следующий класс символов представляет одну из букв нижнего регистра в алфавите, но только одну, так как добавлен квантор [a-z]{1}.

source: For example, we can loop through all the files in our home directory and if they are directories, we will print “$name is a directory” and if not, “$name is a file”.
ru: Например, можно просматривать все файлы в домашнем каталоге, и если очередной файл является подкаталогом, печатаем «$name - это каталог», а если нет, «$name - это файл».

source: For example, we can type the following command to see the activity that is happening on various networking protocols.
ru: Например, можно ввести следующую команду, показывающую, что происходит в различных сетевых протоколах.

source: For example, we might open the top program like so:
ru: Например, можно запустить программу top так:

source: For example, when you run the top command, you will see a bunch of processes listed out.
ru: Например, при запускае top получаем список процессов.

source: For example, with a list of phone numbers, we might look for a specific area code.
ru: Например, в списке телефонных номеров можной найти заданный код зоны.

source: For knowledge bases development support by a domain specialist, a visual domain definition software has been developed.
ru: Разработаны визуальные средства поддержки анализа предметной области разработчиком баз знаний (инженером знаний).

source: For most commands in bash, the man pages are difficult to digest and are generally unhelpful for finding quick answers, but the man page for the test command is super straightforward and simple.
ru: Для большинства команд в bash справочные страницы труднопонимаемые и обычно бесполезны для поиска "быстрых" ответов. Странно, что справочная страница для test проста и понятна.

source: For most common and convenient way to represent a DES, finite state automata, results of P. Ramage and W. Wonham are applied.
ru: Для наиболее распространенного способа представления ДСС, в виде конечных автоматов, будем применять результаты исследований вP. Ramage и W. Wonham.

source: For one, I read the man pages for the top command, but another way to find this info is by typing the ? within the top program.
ru: С одной стороны, это чтение подсказок man, но есть и другой способ - ввод символа ? в запущенной программе top.

source: For our data we obtained about one thousand OTUs.
ru: По нашим данным получено около тысячи OTU.

source: For our intent, these versions are identical, but if you ever run into issues cross-platform, be sure to check that the grep command you are executing is supported in your grep version (certain types of regular expressions not supported in BSD grep).
ru: В рассмотренных далее примерах различия между этими версиями не заметны, но если вдруг в той или иной операционной системе что-то пойдет не по плану, надо уточнить свойства конкретной версии. Например, могут отличаться определенные типы регулярных выражений.

source: For representation of the data, we adapted a number of standardized ontologies.
ru: Для представления данных мы адаптировали ряд стандартизированных онтологий.
